romkatv/zsh-defer

# prompt plugins
romkatv/powerlevel10k

# general plugins
mattmc3/zman
agkozak/zsh-z

# completion plugins
zsh-users/zsh-completions

# deferred plugins
olets/zsh-abbr
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search

